Repository: freyfogle/waybar-weather
Catalog: internal/i18n/locale/*.po
Languages: fr

source: starting waybar-weather service
fr: lancement du service waybar-weather

source: failed to start waybar-weather service
fr: Impossible de démarrer le service waybar-weather

source: shutting down waybar-weather service
fr: On arrête le service waybar-weather

source: Clear sky
fr: Ciel dégagé

source: Mainly clear
fr: Principalement dégagé

source: Partly cloudy
fr: Nuageux

source: Overcast
fr: Ciel couvert

source: Fog
fr: Brouillard

source: Depositing rime fog
fr: Dépôt de brouillard givré

source: Light drizzle
fr: Bruine légère

source: Moderate drizzle
fr: Petite pluie légère

source: Dense drizzle
fr: Pluie fine et dense

source: Light freezing drizzle
fr: Petite pluie glacée

source: Dense freezing drizzle
fr: Froid intense avec une petite pluie fine

source: Slight rain
fr: Petite pluie

source: Moderate rain
fr: Pluie modérée

source: Heavy rain
fr: Forte pluie

source: Light freezing rain
fr: Légère pluie verglaçante

source: Heavy freezing rain
fr: Fortes pluies verglaçantes

source: Slight snow fall
fr: Petite chute de neige

source: Moderate snow fall
fr: Chutes de neige pas trop fortes

source: Heavy snow fall
fr: Fortes chutes de neige

source: Snow grains
fr: Grains de neige

source: Slight rain showers
fr: Petites averses de pluie

source: Moderate rain showers
fr: Averses de pluie modérées

source: Violent rain showers
fr: Averses de pluie violentes

source: Slight snow showers
fr: Petites averses de neige

source: Heavy snow showers
fr: Grosses averses de neige

source: Thunderstorm
fr: Orages

source: Thunderstorm with slight hail
fr: Orage avec un peu de grêle

source: Thunderstorm with heavy hail
fr: Orage avec de gros grêlons

source: no geolocation providers enabled, will not be able to fetch weather data due to missing location
fr: aucun fournisseur de géolocalisation activé, impossible de récupérer les données météo à cause de l'absence de localisation

source: Temperature
fr: Température

source: Humidity
fr: Humidité

source: Wind direction
fr: Direction du vent

source: Wind speed
fr: Vitesse du vent

source: Pressure
fr: Pression

source: Feels like
fr: Ressenti

source: Weather code
fr: Code météo

source: Forecast for
fr: Prévisions pour

source: Weather data for
fr: Données météo pour

source: Sunrise
fr: Lever du soleil

source: Sunset
fr: Coucher de soleil
